Repository: GnoTime/qof
Catalog: qof/po/*.po
Languages: de

source: The QSF XML file '%s' could not be found.
de: Die QSF-XML-Datei »%s« konnte nicht gefunden werden.

source: There was an error parsing the file '%s'.
de: Beim Auswerten der Datei »%s« trat ein Fehler auf.

source: Invalid QSF Object file! The QSF object file '%s' failed to validate against the QSF object schema. The XML structure of the file is either not well-formed or the file contains illegal data.
de: Ungültige QSF-Objektdatei. Die QSF-Objektdatei »%s« anhand des QSF-Objektschemas zu prüfen ist fehlgeschlagen. Die XML-Struktur der Datei hat entweder nicht die richtige Form oder die Datei enthält unzulässige Daten.

source: The QSF map file '%s' could not be found.
de: Die QSF-Kartendatei »%s« konnte nicht gefunden werden.

source: Invalid QSF Map file! The QSF map file failed to validate against the QSF map schema. The XML structure of the file is either not well-formed or the file contains illegal data.
de: Ungültige QSF-Kartendatei. Die QSF-Kartendatei »%s« anhand des QSF-Kartenschemas zu prüfen ist fehlgeschlagen. Die XML-Struktur der Datei hat entweder nicht die richtige Form oder die Datei enthält unzulässige Daten.

source: The selected QSF map '%s' contains unusable or missing data. This is usually because not all the required parameters for the defined objects have calculations described in the map.
de: Die ausgewählte QSF-Kartendatei »%s« enthält unbenutzbare oder fehlende Daten. Der Grund dafür ist üblicherweise, dass nicht alle erforderlichen Parameter für die definierten Objekte auf der Karte beschriebene Berechnungen haben.

source: The QSF Map file '%s' was written for a different version of QOF. It may need to be modified to work with your current QOF installation.
de: Die QSF-Kartendatei »%s« wurde für eine andere Version von QOF geschrieben. Es könnte erforderlich sein, sie zu ändern, damit sie mit der aktuellen QOF-Installation funktioniert.

source: Level of compression to use: 0 for none, 9 for highest.
de: Zu benutzende Kompressionsstufe: 0 für keine, 9 für die höchste.

source: QOF can compress QSF XML files using gzip. Note that compression is not used when outputting to STDOUT.
de: QOF kann QSF-XML-Dateien mit gzip komprimieren. Beachten Sie, dass bei der Ausgabe auf STDOUT keine Komprimierung benutzt wird.

source: List of QSF map files to use for this session.
de: Liste der QSF-Kartendateien zum Benutzen in dieser Sitzung.

source: QOF can convert objects within QSF XML files using a map of the changes required.
de: QOF kann Objekte innerhalb von QSF-XML-Dateien unter Benutzung einer Karte der benötigten Änderungen konvertieren.

source: Encoding string to use when writing the XML file.
de: Entschlüsselungszeichenkette zum Benutzen, wenn die XML-Datei geschrieben wird.

source: QSF defaults to UTF-8. Other encodings are supported by passing the encoding string in this option.
de: QSF-Vorgaben für UTF-8. Andere Verschlüsselungen werden durch Übergabe der Verschlüsselungszeichenkette an diese Option unterstützt.

source: Convert deprecated date values to time values.
de: Missbilligte Datenwerte zu Zeitwerten konvertieren.

source: Applications that support the new QOF time format need to enable this option to convert older date values into time. Applications that still use date should not set this option until time values are supported.
de: Anwendungen, die das neue QOF-Zeitformat unterstützen, müssen diese Option einschalten, um ältere Datumswerte zu Zeitwerten zu konvertieren. Anwendungen, die immer noch das Datum benutzen, sollten diese Option nicht setzen, bis Zeitwerte unterstützt werden.

source: The selected QSF Object file '%s' requires a map but it was not provided.
de: Die ausgewählte QSF-Objektdatei »%s« benötigt eine Karte, aber diese wurde nicht bereitgestellt.

source: When converting XML strings into numbers, an overflow has been detected. The QSF object file '%s' contains invalid data in a field that is meant to hold a number.
de: Bei der Konvertierung von XML-Zeichenketten in Zahlen wurde ein Überlauf bemerkt. Die QSF-Objektdatei »%s« enthält ungültige Daten in einem Feld, das dazu gedacht ist, Nummern zu enthalten.

source: could not write to '%s'. That database may be on a read-only file system, or you may not have write permission for the directory.
de: auf »%s« kann nicht geschrieben werden. Die Datenbank könnte auf einem Dateisystem mit ausschließlichem Lesezugriff liegen oder Sie könnten keine Schreibrechte für dieses Verzeichnis haben.

source: There was an error parsing the file '%s'.
de: Beim Auswerten der Datei »%s« ist ein Fehler aufgetreten.

source: There was an error reading the file '%s'.
de: Beim Lesen der Datei »%s« ist ein Fehler aufgetreten.

source: The selected file '%s' is a QSF map and cannot be opened as a QSF object.
de: Die ausgewählte Datei »%s« ist eine QSF-Karte und kann nicht als ein QSF-Objekt geöffnet werden.

source: Could not write to '%s'. Check that you have permission to write to this file and that there is sufficient space to create it.
de: Auf »%s« kann nicht geschrieben werden. Prüfen Sie, ob Sie die Rechte haben, diese Datei zu schreiben und ob ausreichend Platz vorhanden ist, um sie zu erstellen.

source: The selected QSF object file '%s' contains one or more invalid GUIDs. The file cannot be processed - please check the source of the file and try again.
de: Die ausgewählte QSF-Objektdatei »%s« enthält eine oder mehrere ungültige GUIDs. Die Datei kann nicht verarbeitet werden - bitte prüfen Sie die Quelle der Datei und versuchen Sie es erneut.

source: The selected QSF object file '%s' contains one or more invalid 'collect' values. The file cannot be processed - please check the source of the file and try again.
de: Die ausgewählte QSF-Objektdatei »%s« enthält eine oder mehrere ungültige »collect«-Werte. Die Datei kann nicht verarbeitet werden - bitte prüfen Sie die Quelle der Datei und versuchen Sie es erneut.

source: Unable to open the output file '%s' - do you have permission to create this file?
de: Es ist nicht möglich, die Ausgabedatei »%s« zu öffnen - haben Sie die Rechte, diese Datei zu erstellen?

source: Unable to open the sqlite database '%s'.
de: Es ist nicht möglich, die sqlite-Datenbank »%s« zu öffnen.

source: Please provide a filename for sqlite.
de: Bitte geben Sie einen Dateinamen für sqlite an.

source: Unable to delete record.
de: Der Datensatz kann nicht gelöscht werden.

source: Unable to create record.
de: Der Datensatz kann nicht erstellt werden.

source: Unable to insert a new record.
de: Es kann kein neuer Datensatz eingefügt werden.

source: Unable to update existing record.
de: Bestehender Datensatz kann nicht aktualisiert werden.

source: This book appears to be open already.
de: Dieses Buch scheint bereits geöffnet zu sein.

source: Unable to locate a suitable backend for '%s' - please check you have specified an access method like file: or sqlite:
de: Es konnte kein passendes Backend für »%s« gefunden werden - bitte prüfen Sie, ob Sie eine Zugriffsmethode wie file: oder sqlite: angegeben haben

source: Failed to load backend, no suitable handler.
de: Laden des Backends fehlgeschlagen, keine passender Handler

source: When converting SQLite strings into numbers, an overflow has been detected. The SQLite database '%s' contains invalid data in a field that is meant to hold a number.
de: Beim Konvertieren von SQLite-Zeichenketten in Zahlen wurde ein Überlauf festgestellt. Die SQLite-Datenbank »%s« enthält ungültige Daten in einem Feld, das dazu gedacht ist, eine Zahl zu enthalten.
